In [1]:
import pandas as pd

In [3]:
data1 = pd.read_csv("sample4.txt")
data1

   Age Customer  Income Location
0   30        A  1200.0       A1
1   32        B  1333.0       A2
2   33      NaN     NaN      NaN

In [5]:
data1.isnull().sum()

Age         0
Customer    1
Income      1
Location    1
dtype: int64

In [6]:
data2 = pd.read_csv("sample3.txt",sep="\t")
data2

   Age Customer   Income Location
0   30        A     1200       A1
1   32        B     1333       A2
2   33      NaN  Missing      NaN

In [7]:
data2.isnull().sum()

Age         0
Customer    1
Income      0
Location    1
dtype: int64

In [8]:
data2 = pd.read_csv("sample3.txt",sep="\t",na_values=['Missing','',' '])
data2

   Age Customer  Income Location
0   30        A  1200.0       A1
1   32        B  1333.0       A2
2   33      NaN     NaN      NaN

In [9]:
data2.isnull().sum()

Age         0
Customer    1
Income      1
Location    1
dtype: int64